
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

 &НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	НоменклатураДокумента = Новый Массив;
	НоменклатураДокумента.Добавить(СтрокаТоваров.Номенклатура);
	
	ТипыНоменклатуры = ПолучитьТипыНоменклатуры(НоменклатураДокумента);
	СтрокаТоваров.ТипНоменклатуры = ТипыНоменклатуры[СтрокаТоваров.Номенклатура];
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	НоменклатураДокумента = ПолучитьНоменклатуруДокумента();
	ТипыНоменклатуры = ПолучитьТипыНоменклатуры(НоменклатураДокумента);
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		СтрокаТоваров.ТипНоменклатуры = ТипыНоменклатуры[СтрокаТоваров.Номенклатура];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ОбщегоНазначенияКлиентСервер.ДобавитьПростойЭлементУсловногоОформления(ЭтаФорма,
		"ТоварыСклад", "ОтметкаНезаполненного", Ложь, 
		"Объект.Товары.ТипНоменклатуры", ВидСравненияКомпоновкиДанных.Равно, Перечисления.ТипыНоменклатуры.Услуга);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруДокумента()
	
	ВозвращаемоеЗначение = Новый Массив;
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		ВозвращаемоеЗначение.Добавить(СтрокаТоваров.Номенклатура);
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьТипыНоменклатуры(МассивНоменклатуры)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНоменклатуры, "Тип");
КонецФункции

&НаСервереБезКонтекста
Функция ПодразделениеСклада(Склад)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "Подразделение");
КонецФункции

#КонецОбласти


