
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПриобретениеТоваровИУслуг(Команда)
	
	НоменклатураДокумента = Новый Массив;
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		Если НЕ ТипЗнч(СтрокаСписка) = Тип("СправочникСсылка.Номенклатура") Тогда
			Продолжить;
		КонецЕсли;
		
		НоменклатураДокумента.Добавить(СтрокаСписка);
		
	КонецЦикла;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Номенклатура", НоменклатураДокумента);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Документ.ПриобретениеТоваровИУслуг.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти


